---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternEdgeDistanceX
source: html/0df98445-135f-ddc7-601c-b93d72369c8c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternEdgeDistanceX Property

"Edge distance on side 1"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternEdgeDistanceX { get; }
```